app/controllers/cardpages_controller.rb

  def index
    @cardpages = Cardpage.all
---
SELECT "cardpages".* FROM "cardpages"

  def create
    @cardpage = Cardpage.new(cardpage_params)

    respond_to do |format|
      if @cardpage.save
---
INSERT INTO "cardpages" ("title", "h1", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title cardpage"], ["h1", "h1 i dont know why"], ["body", "It is my body"], ["created_at", "2020-09-10 08:20:43.014147"], ["updated_at", "2020-09-10 08:20:43.014147"]]

    def set_cardpage
      @cardpage = Cardpage.find(params[:id])
---
SELECT  "cardpages".* FROM "cardpages" WHERE "cardpages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]